In [1]:
import pandas as pd
import numpy as np

# Criação de dataframes a partir de um array

In [3]:
arr = np.random.randint(10,55, size=(4,4))

In [4]:
arr

array([[47, 29, 17, 53],
       [16, 19, 40, 36],
       [25, 48, 52, 20],
       [30, 43, 40, 52]])

In [5]:
df1 = pd.DataFrame(data=arr)

In [6]:
df1

    0   1   2   3
0  47  29  17  53
1  16  19  40  36
2  25  48  52  20
3  30  43  40  52

In [7]:
df2 = pd.DataFrame(data=arr, index=['a','b','c','d'])

In [8]:
df2

    0   1   2   3
a  47  29  17  53
b  16  19  40  36
c  25  48  52  20
d  30  43  40  52

In [9]:
df3 = pd.DataFrame(data=arr, index=['a','b','c','d'], columns =['w','x','y','z'])

In [10]:
df3

    w   x   y   z
a  47  29  17  53
b  16  19  40  36
c  25  48  52  20
d  30  43  40  52

# Criação de DataFrames a partir de listas

In [12]:
lista = [[10,20,30,40,50],[60,70,80,90,100],[110,120,130,140,150]]

In [14]:
df4 = pd.DataFrame(data=lista, index=['A','B','C'], columns = ['D','E','F','G','H'])

In [15]:
df4

     D    E    F    G    H
A   10   20   30   40   50
B   60   70   80   90  100
C  110  120  130  140  150

# Criação de DataFrames a partir de dicionários

In [21]:
dados = {'Produtos':['VideoGame','PC','Teclado','Mouse','Microfone'],'Preço':[2600,2450,99.90,75,129]}

In [22]:
df5 = pd.DataFrame(data = dados)

In [23]:
df5

    Produtos   Preço
0  VideoGame  2600.0
1         PC  2450.0
2    Teclado    99.9
3      Mouse    75.0
4  Microfone   129.0

### Criando uma nova coluna

In [25]:
df5['Custo'] = [1900,2000,70,50,90.85]

In [26]:
df5

    Produtos   Preço    Custo
0  VideoGame  2600.0  1900.00
1         PC  2450.0  2000.00
2    Teclado    99.9    70.00
3      Mouse    75.0    50.00
4  Microfone   129.0    90.85

In [28]:
df5['Lucro'] = df5['Preço'] - df5['Custo']

In [29]:
df5

    Produtos   Preço    Custo   Lucro
0  VideoGame  2600.0  1900.00  700.00
1         PC  2450.0  2000.00  450.00
2    Teclado    99.9    70.00   29.90
3      Mouse    75.0    50.00   25.00
4  Microfone   129.0    90.85   38.15